syncosaurus-do-test.yml
config:
  target: "wss://websocket-server.sklarfox.workers.dev"
  phases:
    - duration: 10
      arrivalRate: 50
      name: Adding users to room
  processor: "./doTestFunctions.mjs"
scenarios:
  - name: PresenceData
    engine: ws
    flow:
      - connect: "{{ target }}/?room=foo"
      - function: "generateClientId"
      - send:
          init: true
          clientID: "{{ clientID }}"
      - think: 1
      - loop:
          - function: "generateCoordinates"
          - loop:
              - send:
                  presence: "{{ coordinates }}"
                  clientID: "{{ clientID }}"
            count: 120
          - think: 1
        count: 10

  - name: SubmitIncrement
    engine: ws
    flow:
      - connect: "{{ target }}/?room=foo"
      - function: "generateClientId"
      - send:
          init: true
          clientID: "{{ clientID }}"
      - think: 2
      - loop:
          - send:
              clientID: "{{ clientID }}"
              transactionID: 1234
              mutator: "increment"
              mutatorArgs: { key: "count", delta: 1 }
          - think: 1
        count: 10